Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །གང་ཟག་དེ་ལ་སྲུང་བར་བྱེད། །ཟབ་མོ་སངས་རྒྱས་སྤྱོད་ཡུལ་དང་།
en: I am going to teach this sūtra, Which is the profound field of the buddhas.

source: །སངས་རྒྱས་དགོངས་ཏེ་གསུངས་པའི་བཀའ། །མདོ་སྡེ་གང་ཡིན་ངས་བཤད་པ། །བསྐལ་པ་བྱེ་བར་ཕྲད་དཀའ་བས། །གང་གིས་མདོ་སྡེ་འདི་ཐོས་ནས། །གཞན་ལ་རྒྱ་ཆེར་སྟོན་པ་དང་། །གལ་ཏེ་སེམས་ཀྱིས་ཡི་རངས་དང་།
en: The intent of the buddhas, the teaching that is spoken, Is difficult to encounter in a million eons. “

source: །མཆོད་པ་བཤམས་ནས་མཆོད་བྱེད་ན། །དེ་འདྲའི་གང་ཟག་དེ་དག་ནི། །བསྐལ་པ་ཚད་མེད་སྙེད་དུ་ཡང་། །རྟག་པར་ལྷ་དང་མི་རྣམས་དང་། །ཀླུ་ལ་སོགས་པས་མཆོད་བཀུར་འགྱུར།
en: Anyone who hears this sūtra And teaches it extensively to others, Anyone who rejoices in this sūtra And who sets out offerings to it, “Such individuals as those Will be continuously offered to Throughout countless eons By devas, nāgas, humans, and so on. “

source: །འདི་ཡི་བསོད་ནམས་ཚད་མེད་པས། །གང་གཱའི་བྱེ་སྙེད་གྲངས་ལས་འདས། །མདོ་སྡེ་འདི་ནི་གང་ཀློག་པ། །ཡོན་ཏན་འདི་དག་ཐོབ་པར་འགྱུར།
en: Because of its immeasurable merit, Greater than the amount of sand grains in the Ganges, Whoever reads this sūtra Will obtain those qualities. “

source: །ཕྱོགས་བཅུའི་བཅོམ་ལྡན་འདས་རྣམས་དང་། །སྤྱོད་ཟབ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས། །མདོ་སྡེ་འཛིན་ལ་ཡོངས་བསྲུངས་ནས། །སྡུག་བསྔལ་བགེགས་དང་བྲལ་བར་མཛད།
en: The bhagavats in the ten directions And the bodhisattvas with profound activity Will thoroughly protect holders of this sūtra And free them from suffering and obstacles. “

source: །མདོ་སྡེ་འདི་ནི་གང་མཆོད་པས། །སྔ་མ་བཞིན་དུ་ལུས་བཀྲུས་ནས། །ཟས་དང་མེ་ཏོག་སྤོས་མཆོད་ཅིང་། །བྱམས་དང་སྙིང་རྗེའི་སེམས་བསྐྱེད་དེ།
en: Those who make offerings to this sūtra Should, as before, wash their bodies And offer food, flowers, and perfume And have a loving, compassionate mind. “

source: །མདོ་སྡེ་འདི་ནི་ཉན་འདོད་པས། །སེམས་གཙང་དྲི་མ་མེད་བྱས་ཏེ། །རྟག་པར་དགའ་བའི་སེམས་བསྐྱེད་ན། །ཡོན་ཏན་མང་པོ་སྐྱེ་བར་འགྱུར།
en: Those who wish to listen to the sūtra Should make their minds pure and stainless, And if they constantly generate joy, Many good qualities will arise. “

source: །གང་ཞིག་གུས་པའི་སེམས་དག་གིས། །མདོ་སྡེ་འདི་ནི་ཉན་བྱེད་ན། །ལེགས་པར་མི་ཡི་འགྲོར་སྐྱེ་ཞིང་། །སྡུག་བསྔལ་བགེགས་དང་འབྲལ་བར་འགྱུར།
en: Those who listen to this sūtra With veneration in their minds Will have an excellent human rebirth And will be free of suffering and obstacles. “

source: །དེ་ནི་དགེ་རྩ་སྨིན་པས་ན། །སངས་རྒྱས་རྣམས་ཀྱིས་བསྔགས་པ་ཡི། །མདོ་སྡེ་འདི་ནི་ཐོས་པ་དང་། །འགྱོད་ཚངས་ཆོས་ནི་ཐོས་པ་ཡིན།
en: It is through the ripening of good roots That they hear this sūtra, Which is praised by the buddhas, And hear the Dharma of purification through regret.”

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་གླེང་གཞིའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: This concludes “The Introduction,” the first chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན།
en: Chapter 2: The Teaching of the Lifespan of the Tathāgata At that time, there dwelled in the great city of Rājagṛha a bodhisattva mahāsattva by the name of Ruciraketu.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཛེས་པའི་ཏོག་ཅེས་བྱ་བ་འདས་པའི་སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱ་སྟོང་ཚད་མེད་པ་རྣམས་ལ་བསྙེན་བཀུར་དང་རིམ་གྲོ་བྱས་ནས་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ཞིག་ཡོད་དེ།
en: He had planted good roots by serving and attending upon countless hundreds of thousands of quintillions of buddhas.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ཅེས་བྱ་བ་གཅིག་པུ་དབེན་པར་གནས་པ་དེ་འདི་སྙམ་དུ་རྒྱུ་གང་དང་རྐྱེན་གང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་སྐུ་ཚེ་ཐུང་སྟེ་ལོ་བརྒྱད་ཅུར་གྱུར་སྙམ་མོ།
en: The bodhisattva Ruciraketu was staying alone in solitude then, and he was thinking, “Through what causes and through what conditions does the Bhagavat Śākyamuni have such a short lifespan of eighty years?”

source: །གཞན་ཡང་འདི་སྙམ་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་གསུངས་པ་ལྟར་ན་རྒྱུ་དང་རྐྱེན་རྣམ་པ་གཉིས་ཀྱིས་ཚེ་རིང་པོར་འགྱུར་རོ།
en: He also thought, “The Bhagavat has said, ‘There are two causes and two conditions for a long life.

source: །ཞེས་གསུངས་ཏེ། གཉིས་གང་ཞེ་ན་སེམས་ཅན་གྱི་སྲོག་མི་གཅོད་པ་དང་། གཞན་དག་ལ་ཡང་བཟའ་བ་དང་བཏུང་བ་ཡོངས་སུ་བཏང་བའོ།
en: What are those two? Not killing beings and giving food and drink to others.’

source: །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ནི་འདས་པའི་བསྐལ་པ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པ་སྙེད་དུ་སེམས་ཅན་གྱི་སྲོག་མ་བཅད་ཅིང་དགེ་བ་བཅུའི་ལས་ཀྱིས་ལམ་སྤྱོད་པ་དང་། རྟག་པར་བཟའ་བ་དང་། བཏུང་བ་དག་བཀྲེས་པའི་སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱིན་པ་བཏང་སྟེ། ཉིད་ཀྱི་ཤ་དང་།
en: The Bhagavat Śākyamuni has forsaken killing beings and has practiced the path of the ten good actions for many countless hundreds of thousands of quintillions of eons.

source: ཁྲག་དང་། རུས་པ་དང་། རྐང་ལ་སོགས་པ་ཡང་ཡོངས་སུ་བཏང་ནས་རབ་ཏུ་ཚིམ་པར་མཛད་ན། བཟའ་བ་དང་། བཏུང་བ་གཞན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་སྙམ་མོ།
en: He has always given food and drink to all hungry beings, even satisfying them with his own flesh, blood, bones, legs, and so on, not to mention any other kind of food and drink.”

source: །བྱང་ཆུབ་སེམས་དཔའ་དེས་བཅོམ་ལྡན་འདས་ལ་དེ་སྙམ་དུ་བསམས་པའི་ཚེ། །བཅོམ་ལྡན་འདས་ཀྱིས་བྱིན་གྱིས་བརླབས་ཀྱི་མཐུས་དེའི་ཁང་ཁྱིམ་དེ་མ་ཐག་ཏུ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་དང་། བཀོད་པ་དང་ལྡན་ཞིང་ཡོངས་སུ་གཙང་བ་དང་། བཻ་ཌཱུརྱ་སྔོན་པོ་དང་། རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པས་སངས་རྒྱས་ཀྱི་ཞིང་ཇི་ལྟ་བ་བཞིན་དུ་སྤོས་མཆོག་དམ་པའི་དྲི་ལྷའི་སྤོས་ལས་འདས་པ་དག་འཐུལ་ཞིང་གང་བ་དང་།
en: When that bodhisattva was thinking that about the Bhagavat, through the power of the blessing of the Bhagavat his house became instantly vast and immense, decorated and clean, adorned by blue beryls and various jewels, so that it was like a buddha realm that was permeated by the wafting, sublime scents of supreme perfumes that transcended the perfumes of the devas.

source: ཕྱོགས་བཞིན་སེང་གེའི་གདན་ཁྲི་མཆོག་དམ་པ་རིན་པོ་ཆེ་སྣ་བཞི་ལས་མངོན་པར་གྲུབ་པ། ལྷའི་རིན་པོ་ཆེའི་གོས་ཀྱིས་གཡོགས་པ་དང་།
en: In the four directions there spontaneously appeared perfect lion thrones made of the four sublime jewels, covered by divine precious cloth.

source: གཞན་ཡང་གདན་དེ་ལ་པདྨ་དམ་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་ཚད་དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པ་དག་རང་གི་ངང་གིས་སྣང་བར་གྱུར་ཏེ།
en: On those thrones were sublime lotuses adorned by various jewels, and their sizes were in proportion to those of the tathāgatas.

source: པདྨ་དེ་དག་གི་སྟེང་ན་དེ་བཞིན་གཤེགས་པ་བཞི་པོ་ཤར་ཕྱོགས་ཀྱི་མི་འཁྲུགས་པ་དང་། ལྷོ་ཕྱོགས་ཀྱི་རིན་ཆེན་མཚན་དང་། ནུབ་ཕྱོགས་ཀྱི་ཚེ་དཔག་མེད་དང་། བྱང་ཕྱོགས་ཀྱི་ལྷའི་རྔ་སྒྲ་དབྱངས་བཞུགས་པར་གྱུར་ཏོ།
en: Upon those lotuses there were four tathāgatas: Akṣobhya of the east, Ratnaketu of the south, Amitābha of the west, and Dundubhisvara of the north.

source: །དེ་བཞིན་གཤེགས་པ་བཞི་པོ་དེ་དག་སོ་སོ་ནས་གདན་དེ་དག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་ནས་འོད་ཟེར་ཆེན་པོ་བཀྱེ་བས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དང་། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་སྙེད་ཀྱི་བར་དུ་ཡང་སྣང་བས་ཀུན་ཏུ་ཁྱབ་པར་མཛད་དེ།
en: Those tathāgatas each sat cross-legged on their individual thrones and radiated light rays that spread through and illuminated the great city of Rājagṛha, the trichiliocosm world realm, and throughout as many buddha realms in the ten directions as there are grains of sand in the Ganges River.

source: ལྷའི་མེ་ཏོག་གི་ཆར་ཡང་མངོན་པར་ཕབ་ལྷའི་རོལ་མོའི་སིལ་སྙན་རྣམས་ཀྱང་དཀྲོལ་བར་གྱུར་ཏེ།
en: A rain of divine flowers fell, and the sound of divine music played.

source: དེའི་ཚེ་འཛམ་བུའི་གླིང་འདི་དང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན། སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་བྱིན་གྱིས་བརླབས་ཀྱི་མཐུས་བདེ་བ་མཆོག་དམ་པ་མྱོང་བར་གྱུར་པས་ཕོངས་པ་ཅི་ཡང་མེད་པར་གྱུར་ཏོ། །ལུས་ཀྱི་ཡན་ལག་མ་ཚང་བ་དག་ནི་ཚང་བར་གྱུར། ལོང་བ་དག་ནི་མཐོང་བར་གྱུར། འོན་པ་རྣམས་ནི་ཐོས་པར་གྱུར། ལྐུགས་པ་དག་ནི་སྨྲ་བར་གྱུར།
en: At that time, through the power of the Bhagavat’s blessing, all beings in this trichiliocosm world realm experienced perfect bliss and were free of all distress.

source: གླེན་པ་དག་ནི་ཤེས་རབ་དང་ལྡན་པར་གྱུར།
en: Those who did not have all their limbs became complete.

source: སེམས་འཁྲུགས་པ་དག་ནི་སེམས་ཉིད་ཐོབ་པར་གྱུར། བགོ་བ་མེད་པ་དག་ནི་གོས་དང་ལྡན་པར་གྱུར། རབ་ཏུ་སྨད་ཅིང་བཤུངས་པ་དག་ནི་གཞན་གྱིས་བཀུར་བར་གྱུར། དྲི་མ་དང་བཅས་པ་དག་ནི་ལུས་གཙང་བར་གྱུར་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕན་འདོགས་པའི་དངོས་པོ་ངོ་མཚར་རྨད་དུ་ཆེ་བ་སྔོན་མ་བྱུང་བ་རྣམས་ཀྱང་མངོན་དུ་བྱུང་བར་གྱུར་ཏོ།
en: The blind saw; the deaf heard; the mute spoke; the stupid became wise; those who were disturbed regained their minds; the unclothed became clothed; those who were inferior and derided became respected by others; those with dirty bodies became clean; and extremely wonderful, beneficial things such as had never been seen before appeared in this world realm.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་དེ་བཞིན་གཤེགས་པ་བཞི་དང་། ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དངོས་པོ་དེ་དག་མཐོང་བས་དགའ་མགུ་རངས་པར་གྱུར་ནས་ཐལ་མོ་སྦྱར་ཏེ།
en: On seeing the four tathāgatas and those wonderful, amazing things, the bodhisattva Ruciraketu was delighted and overjoyed.

source: སེམས་རྩེ་གཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཚན་ཁྱད་པར་དུ་འཕགས་པ་དག་ལ་རྣམ་པར་བལྟས་ནས།
en: He placed his palms together in homage and with a one-pointed mind gazed upon the superior features of the tathāgatas.

source: གཞན་ཡང་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཡོན་ཏན་ཚད་མེད་པ་དང་ལྡན་ཡང་། སྐུ་ཚེའི་ཚད་འབའ་ཞིག་ལ་ཐེ་ཙོམ་གྱི་སེམས་སྐྱེས་པར་གྱུར་ནས། ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཚད་མེད་པ་མངའ་ཡང་སྐུ་ཚེ་ཐུང་སྟེ་ལོ་བརྒྱད་ཅུ་ཁོ་ན་བཞུགས་པར་གྱུར་སྙམ་མོ། །དེ་ནས་བཅོམ་ལྡན་འདས་བཞི་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: He also wondered why the Tathāgata Śākyamuni, who possesses limitless qualities, has only the lifespan he has, thinking, “Why does the Tathāgata Śākyamuni, even though he possesses limitless qualities, have such a short life of only eighty years?”

source: །རིགས་ཀྱི་བུ་ངེད་ཀྱིས་ནི་བླ་ན་མེད་པའི་ཐམས་ཅད་མཁྱེན་པ་མ་གཏོགས་པར་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ན། ཚངས་པ་དང་། བདུད་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། མི་དང་མི་མ་ཡིན་པ་གང་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་ཀྱི་མཐའ་ཤེས་ཤིང་དཔག་པར་འགྱུར་བ་ཡང་དག་པར་མ་གཟིགས་སོ།
en: The four bhagavats then said to the bodhisattva Ruciraketu, “Noble one, except for we who have unsurpassable omniscience, we do not see any brahmās, māras, mendicants, brahmins, humans, or nonhumans in this world with its devas who can know or calculate the end of the lifespan of the Tathāgata.”

source: །དེ་བཞིན་གཤེགས་པ་བཞི་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པར་བཞེད་པ་ན། བཅོམ་ལྡན་འདས་ཀྱིས་བྱིན་གྱིས་བརླབས་ཀྱི་མཐུས་འདོད་པ་དང་གཟུགས་ཀྱི་ཁམས་ཀྱི་ལྷ་རྣམས་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: When those bhagavats taught the lifespan of the Bhagavat Śākyamuni, through the power of the blessing of the Bhagavat, the devas in the desire and form realms, the nāgas, the yakṣas, the gandharvas, the asuras, the garuḍas, the kinnaras, the mahoragas, and the many hundreds of thousands of quintillions of assembled bodhisattvas gathered and came to the bodhisattva Ruciraketu’s house.

source: མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་འདུས་ཏེ་ལྷགས་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གི་ཁྱིམ་ཡོངས་སུ་དག་ཅིང་གྱ་ནོམ་པ་དེར་ཞུགས་པར་གྱུར་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་བཞི་པོ་དེ་དག་གིས་འཁོར་མང་པོའི་ནང་དུ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་ཇི་སྙེད་པ་དག་བསྟན་པར་བཞེད་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། །རྒྱ་མཚོ་ཐམས་ཅད་ཀུན་གྱི་ཆུ།
en: Then those four bhagavats within that vast assembly recited these verses in order to teach the length of the lifespan of the Tathāgata Śākyamuni: “One could know the number of drops In the water of all the oceans, But still no one could calculate The lifespan of Śākyamuni. “

source: །ཐིགས་པའི་གྲངས་ནི་ཤེས་རུང་གི །ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད། །གང་གིས་ཀྱང་ནི་བགྲང་མི་ནུས། །རི་རབ་ཐམས་ཅད་རྡུལ་བརླགས་ཏེ། །ཡུངས་འབྲུ་བཞིན་དུ་བགྲང་ཤེས་ཀྱང་།
en: If all Sumerus were broken down into particles Like mustard seeds, their number could be known, But still no one could calculate The lifespan of Śākyamuni. “

source: །ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད། །གང་གིས་ཀྱང་ནི་བགྲང་མི་ནུས། །ས་ཆེན་རྡུལ་ནི་ཐམས་ཅད་ཀུན། །རྡུལ་གྲངས་ཅི་ཡོད་ཤེས་རུང་ཡང་། །ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད།
en: If one could know the number of particles That make up the entirety of the great earth, Still no one would be able to calculate The lifespan of Śākyamuni. “

source: །གང་གིས་ཀྱང་ནི་བགྲང་མི་ནུས། །གལ་ཏེ་ནམ་མཁའི་ཚད་བཅལ་ཏེ། །མཐའ་ཀུན་དཔག་པར་རུང་སྲིད་ཀྱང་། །ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད། །གང་གིས་ཀྱང་ནི་དཔག་མི་ནུས།
en: Even if it were possible that someone Could measure the entire extent of space, Still no one would be able to measure The lifespan of Śākyamuni. “

source: །མི་ཞིག་བསྐལ་པ་བྱེ་བར་གནས། །མཐས་གཏུགས་རྟག་པར་རྩིས་བགྲངས་ཀྱང་། །བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ཚེའི་ཚད། །ཡོངས་སུ་ཤེས་པར་མི་འགྱུར་རོ།
en: Even if someone kept counting While living for ten million eons, They would not be able to determine The lifespan of the Bhagavat. “

source: །སེམས་ཅན་སྲོག་ནི་མ་བཅད་ཅིང་། །བཟའ་བཏུང་སྦྱིན་པ་བཏང་བ་ཡིན།
en: This is because of two causes And because of two conditions: He has not taken the life of beings And has made the gift of food and drink.

source: །རྒྱུ་ནི་རྣམ་པ་འདི་གཉིས་ཀྱིས། །སྐུ་ཚེ་རིང་པོ་བརྙེས་པ་ཡིན།
en: It is through those two causes That he has attained a long life. “

source: །དེ་བས་ཐུབ་པ་ཆེན་པོ་ཡི། །སྐུ་ཚེའི་ཚད་ནི་ཤེས་པར་དཀའ།
en: Therefore, it is difficult to know The lifespan of the great Muni.

source: །བསྐལ་པའི་མཐའ་ནི་མེད་པ་ལྟར། །སྐུ་ཚེའི་ཚད་ཀྱང་དེ་བཞིན་ནོ།
en: The length of his lifespan is like An eon that has no end. “

source: །མཛེས་པའི་ཏོག་ཁྱོད་ཤེས་བྱོས་ལ།
en: Ruciraketu, you should know this.

source: །ཐེ་ཙོམ་སོམ་ཉི་མ་བསྐྱེད་ཅིག །
en: Do not have doubt or uncertainty.

source: རྒྱལ་བའི་སྐུ་ཚེའི་ཚད་མེད་པས། །དེ་ཡི་གྲངས་ནི་ཤེས་མི་ནུས།
en: The lifespan of the Jina is measureless; The number of its years cannot be known.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས། དེ་བཞིན་གཤེགས་པ་བཞི་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་ཚེའི་ཚད་དཔག་ཏུ་མེད་པར་བཀའ་སྩལ་པ་ཐོས་པ་དང་། བཅོམ་ལྡན་འདས་དེ་དག་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཅིའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་དེ་ལྟ་བུའི་སྐུ་ཚེ་ཐུང་བར་བསྟན་པར་མཛད་ལགས།
en: Then the bodhisattva Ruciraketu, having heard from those four tathāgatas the teaching on the lifespan of the Bhagavat Śākyamuni, asked those bhagavats, “Why is it that the Bhagavat Śākyamuni, the Tathāgata, manifests such a short lifespan?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་བཞི་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་སྙིགས་མ་ལྔའི་དུས་སུ་འཇིག་རྟེན་དུ་བྱུང་བ་ན་མི་རྣམས་ཚེ་ལོ་བརྒྱ་པར་གྱུར་ཅིང་རང་བཞིན་དམན་པ་དང་།
en: The four bhagavats replied to the bodhisattva Ruciraketu, “Noble one, the Bhagavat Śākyamuni has come into the world at the time of the five degenerations.

source: དགེ་བའི་རྩ་བ་ཕྲ་ཞིང་ཆུང་བ་དང་། མོས་པ་མེད་པར་གྱུར་པས་སེམས་ཅན་དེ་དག་ལས་ཕལ་ཆེར་བདག་ཏུ་ལྟ་བ་དང་། གང་ཟག་ཏུ་ལྟ་བ་དང་།
en: Humans have a hundred-year lifespan, an inferior nature, few and feeble good roots, and no aspiration.

source: སེམས་ཅན་དང་སྲོག་དང་། གསོ་བ་པོ་དང་། ལོག་པར་ལྟ་བ་དང་། བདག་དང་། བདག་གིར་ལྟ་བ་དང་།
en: Therefore, most of those beings have the view that there is a self, the view that there is an individual, the view that there is a being and a soul, the view that there is a spirit; they hold erroneous views, the view that there is a ‘me’ and ‘mine,’ the views of eternalism and nihilism, and so on.

source: རྟག་པ་དང་། ཆད་པར་ལྟ་བ་ལ་སོགས་པ་དང་ལྡན་པས་སེམས་ཅན་མང་པོ་དེ་དག་དང་། མུ་སྟེགས་ཅན་མང་པོ་དེ་དག་ལ་ཕན་གདགས་ཤིང་ཡང་དག་པའི་ཤེས་པ་བསྐྱེད་ནས་མྱུར་དུ་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་དེ་ལྟ་བུའི་སྐུ་ཚེ་ཐུང་བ་བསྟན་པ་ཡིན་ནོ།
en: Therefore, the Tathāgata Śākyamuni manifests such a short lifespan so as to benefit many beings and many tīrthikas, so that they will develop true knowledge and quickly attain the highest, most complete enlightenment. “

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དེས་སེམས་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མཐོང་བར་གྱུར་ན་ཤིན་ཏུ་མཐོང་བར་དཀའ་བའི་འདུ་ཤེས་དང་། མྱ་ངན་དང་།
en: Moreover, noble one, if those beings see the Tathāgata passing into nirvāṇa, that will cause them to perceive him as being extremely difficult to see.

source: སྡུག་བསྔལ་བ་ལ་སོགས་པའི་འདུ་ཤེས་བསྐྱེད་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་མདོ་སྡེའི་བསྟན་པ་དག་མྱུར་དུ་ལེན་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་དུ་འདོན་པ་དང་།
en: They will perceive misery, suffering, and so on, and they will quickly obtain, possess, carry, read, chant, comprehend, and teach others the teachings of the sūtras spoken by the Buddha Bhagavat and they will not criticize them.

source: ཀུན་ཆུབ་པར་བྱས་ནས་གཞན་དག་ལ་ཡང་དག་པར་བསྟན་པ་དང་། སྐུར་པ་འདེབས་པར་མི་འགྱུར་བར་མཛད་པར་བཞེད་པའི་ཕྱིར་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པས་དེ་ལྟ་བུའི་སྐུ་ཚེ་ཐུང་བ་བསྟན་པ་ཡིན་ནོ།
en: That is why the Tathāgata manifests such a short lifespan. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: སེམས་ཅན་དེ་དག་གིས་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བ་མཐོང་བར་གྱུར་ན་གུས་པས་རིམ་གྲོ་ཡང་མི་བྱེད།
en: If beings saw that the Tathāgata did not pass into nirvāṇa, they would not reverently attend upon him.

source: ཤིན་ཏུ་ཕྲད་པར་དཀའ་བའི་འདུ་ཤེས་ཀྱང་མི་སྐྱེད་ལ་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་སྡེ་ཟབ་མོ་དག་ཀྱང་ལེན་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་དུ་འདོན་པ་དང་། ཀུན་ཆུབ་པར་བྱས་ནས་གཞན་དག་ལ་སྟོན་པར་ཡང་མི་བྱེད་པས་སོ།
en: They would not perceive him as extremely difficult to meet, and they would not obtain, possess, read, chant, comprehend, and teach others the profound sūtras spoken by the Tathāgata.

source: འདི་ལྟར་རྟག་པར་སངས་རྒྱས་མཐོང་བས་གུས་པར་མི་བྱེད་པའི་ཕྱིར་རོ།
en: They would have no reverence because they would always see the Buddha. “

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་མི་ཞིག་གིས་བདག་གི་ཕ་ལ་ནོར་དང་། རིན་པོ་ཆེ་མང་ཞིང་འཕེལ་བ་དག་མཐོང་བར་གྱུར་ན། ནོར་རྫས་དག་ལ་ངོ་མཚར་དང་། མཐོང་བར་དཀའ་བའི་འདུ་ཤེས་སྐྱེ་བར་མི་འགྱུར་རོ།
en: As an analogy, noble one, if a man sees that his father has many jewels and increasing wealth, he will not perceive that wealth as wonderful or a rare sight.

source: ཕའི་ནོར་རྫས་དག་ལ་རྟག་པའི་འདུ་ཤེས་སྐྱེད་པའི་ཕྱིར་རོ།
en: It is because he perceives his father’s wealth to be permanent. “

source: །རིགས་ཀྱི་བུ་སེམས་ཅན་མང་པོ་དེ་དག་ཀྱང་དེ་བཞིན་དུ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བ་མཐོང་བར་གྱུར་ན་ངོ་མཚར་དང་མཐོང་བར་དཀའ་བའི་འདུ་ཤེས་སྐྱེ་བར་མི་འགྱུར་རོ།
en: Noble one, in the same way, if these many beings saw that the Bhagavat never passed into nirvāṇa, they would not perceive him as wonderful and difficult to see.

source: རྟག་པར་མཐོང་བའི་ཕྱིར་རོ།
en: Because they would see him as permanent. “

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་མི་ཞིག་ཕ་མ་དབུལ་ཞིང་ནོར་རྫས་ཀྱིས་ཕོངས་པར་གྱུར་པ་ལས་མི་དབུལ་པོ་དེ་རྒྱལ་པོའི་ཕོ་བྲང་ངམ། བློན་པོ་ཆེན་པོའི་ཁྱིམ་དག་ཏུ་ཕྱིན་ཏེ། བང་མཛོད་རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། ནོར་རྫས་ཀྱིས་ཡོངས་སུ་གང་བ་མཐོང་བར་གྱུར་ན།
en: As another analogy, noble one, if a man who has poor parents devoid of wealth goes to a king’s palace or a great minister’s mansion and sees it filled with various precious treasuries and wealth, he will perceive this as marvelous and difficult to encounter.

source: ངོ་མཚར་དང་ཕྲད་པར་དཀའ་བའི་འདུ་ཤེས་བསྐྱེད་ནས་དེའི་ཚེ་མི་དབུལ་པོ་དེ་ནོར་རྫས་ཡོངས་སུ་གཉེར་བའི་ཕྱིར་སྦྱོར་བའི་ཐབས་རྒྱ་ཆེར་བཤམས་ནས་ལེ་ལོ་མི་བྱེད་པར་རབ་ཏུ་བརྩོན་པར་བྱེད་དོ།
en: Then that poor man will commence on various methods in order to acquire wealth and do so with diligence and without idleness.

source: དབུལ་ཕོངས་པ་སྤངས་ཤིང་བདེ་བའི་ལོངས་སྤྱོད་ཉམས་སུ་མྱོང་བར་བྱ་བའི་ཕྱིར་རོ།
en: He does so in order to leave behind poverty and destitution and to experience the enjoyment of happiness. “

source: །རིགས་ཀྱི་བུ་སེམས་ཅན་མང་པོ་དེ་དག་ཀྱང་དེ་བཞིན་དུ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མཐོང་བར་གྱུར་ན། མཐོང་བར་དཀའ་བའི་འདུ་ཤེས་ནས་མྱ་ངན་དང་སྡུག་བསྔལ་བ་ལ་སོགས་པའི་འདུ་ཤེས་ཀྱི་བར་དག་ཀྱང་བསྐྱེད་ནས་གཞན་ཡང་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་བསྐལ་པ་གྲངས་མེད་ཚད་མེད་པ་སྙེད་འདས་ནས་གདོད་འཇིག་རྟེན་དུ་འབྱུང་བས།
en: In the same way, noble one, if those many beings see that the Tathāgata passes into nirvāṇa, they will perceive him as difficult to see, they will develop the perception of him as difficult to see, and so on, up to the perception of misery, suffering, and so on. Moreover, they will think, ‘The tathāgatas appear in the world only after countless, measureless eons have passed.

source: ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་བཞིན་དུ་བརྒྱ་ལ་བརྒྱ་ལམ་ན་ལན་ཅིག་འབྱུང་བར་འགྱུར་རོ།
en: Like fig tree flowers, they hardly ever appear, and then just one time.’

source: །ཞེས་སེམས་ཅན་མང་པོ་དེ་དག་ངོ་མཚར་གྱིས་བསམ་པ་བསྐྱེད་ནས་ཤིན་ཏུ་མཐོང་བར་དཀའ་བའི་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དེ།
en: Thus those many beings will think of him as wonderful and perceive him as difficult to see.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་གྱུར་ན་ཡང་སེམས་ཀྱིས་གུས་པ་དང་དང་བསྐྱེད་པར་བྱེད་ལ། ཡང་དག་པའི་ཆོས་བསྟན་པ་ཐོས་པར་གྱུར་ན་ཡང་དག་པའི་བཀའ་ཡིན་ནོ་སྙམ་པའི་འདུ་ཤེས་བསྐྱེད་ནས། མདོ་སྡེ་ཇི་སྙེད་པ་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་འཛིན་ཅིང་སྐུར་པ་འདེབས་པར་མི་བྱེད་དོ།
en: Then if they see the Tathāgata, they will have veneration and delight, and if they hear the true Dharma teaching, they will perceive it as being the true teaching and they will correctly hold all the sūtras and not criticize them. “

source: །རིགས་ཀྱི་བུ་རྒྱུ་དང་རྐྱེན་དེས་ན་བཅོམ་ལྡན་འདས་དེ་ཡུན་རིང་དུ་འཇིག་རྟེན་ན་མི་བཞུགས་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཡིན་ཏེ།
en: Therefore, noble one, because of those causes and conditions, the Tathāgata does not remain long in the world but passes into nirvāṇa. “

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་དེ་ལྟ་བུའི་ཐབས་མཁས་པ་མཁྱེན་ནས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ཡིན་ནོ།
en: Noble one, the tathāgatas ripen beings through knowing such skillful methods.”

source: །དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བཞི་པོ་དེ་དག་གིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: At that time, the four tathāgatas having spoken, they vanished.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཛེས་པའི་ཏོག་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་དང་། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱད་སྟོང་ཚད་མེད་པ་དག་དང་ལྷན་ཅིག་ཏུ་བྱ་རྒོད་ཕུང་པོའི་རི་ག་ལ་བ་དེར་དོང་སྟེ།
en: Then the bodhisattva Ruciraketu went to Vulture Peak Mountain together with countless hundreds of thousands of bodhisattvas and the countless hundreds of thousands of quintillions of other beings.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཐམས་ཅད་མཁྱེན་པའི་སྤྱན་སྔར་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: They arrived before the omniscient Tathāgata Śākyamuni and bowed their heads to the feet of the Bhagavat and sat to one side.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས་དངོས་པོ་གོང་དུ་བསྟན་པ་དེ་དག་བཅོམ་ལྡན་འདས་ལ་རྒྱས་པར་གསོལ་པ་དང་།
en: The bodhisattva Ruciraketu then described in detail what had occurred.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བཞི་པོ་དེ་དག་ཀྱང་བྱ་རྒོད་ཕུང་པོའི་རི་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་གཤེགས་ཏེ། སོ་སོའི་ཕྱོགས་ཇི་ལྟ་བ་བཞིན་དུ་གདན་ལ་བཞུགས་ནས་ཞབས་འབྲིང་བའི་བྱང་ཆུབ་སེམས་དཔའ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ཁྱེད་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་དོང་ལ་ངེད་ཀྱི་ཚིག་གིས་ཅུང་ཟད་མི་བསྙུང་ངམ།
en: At that time, the four tathāgatas came to where the Bhagavat Śākyamuni was on Vulture Peak Mountain, sat upon the thrones in their individual directions, and said to their bodhisattva attendants, “Noble ones, go to the Bhagavat Śākyamuni and repeat to him these words of ours, asking after his health: ‘Are you not a little unwell?

source: ཅུང་ཟད་མི་གདུང་ངམ།
en: Are you not in some pain?

source: བཞེངས་ཤིང་བཞུགས་པ་ཡང་ངམ། སྤྱོད་ལམ་ཐམས་ཅད་དུ་བདེ་བར་སྤྱོད་དམ་ཞེས་སྙུན་གསོལ་ཅིག །
en: Whether you are standing or sitting, in all your activity, are you in good health?’

source: གཞན་ཡང་འདི་སྐད་དུ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་གདགས་ཤིང་མུ་གེའི་བགེགས་ཡོངས་སུ་བསལ་ནས་བདེ་བ་ལ་འགོད་པར་བཞེད་པའི་ཕྱིར་དེང་གསེར་འོད་དམ་པའི་མདོ་སྡེ་ཤིན་ཏུ་ཟབ་མོའི་ཆོས་ཀྱི་དོན་བསྟན་པ་ལེགས་སོ་ལེགས་སོ།
en: Also say this to him: ‘If the Tathāgata Śākyamuni, in order to benefit beings, to dispel the obstacle of famine, and to bring happiness, were to teach today The Sūtra of the Sublime Golden Light, the meaning of the extremely profound Dharma, that would be excellent, excellent!

source: །བདག་ཅག་རྣམས་ཀྱང་རྗེས་སུ་ཡི་རང་ངོ་ཞེས་གསོལ་ཅིག །
en: And we also would rejoice in it.’ ”
